package project;

public class Libretto {
    public static final String swanLakeLibretto = """
            ПРОЛОГ
            
            Старинный парк. Принцесса Одетта грустит. Внезапно появляется незнакомец в сопровождении свиты.
            Это Ротбарт – Злой гений. Он предлагает принцессе руку и сердце, но Одетта отвергает его.
            Ротбарт превращает ее в белого лебедя.
            
            ДЕЙСТВИЕ ПЕРВОЕ
            
            Картина первая
            Сад перед замком владетельной принцессы. Принц Зигфрид веселится с друзьями:
            забавные пляски шута сменяются танцами девушек и их кавалеров.
            Владетельная принцесса интересуется, какая же из девушек пришлась Зигфриду по сердцу.
            Но пока принц увлечен жизнью, полной беспечных развлечений. Он ничего не может ответить матери.
            Владетельная принцесса удаляется.Веселье продолжается.
            Но теперь оно перестает занимать Зигфрида. После танца с кубками принц просит друзей оставить его одного.
            Он грустит. Его взор привлекает летящая стая лебедей. Зигфрид берет арбалет и направляется вслед за ними.
            
            Картина вторая
            
            Берег озера. Лебеди приводят Зигфрида в глухую лесную чащу, где вокруг темного озера высятся развалины
            старого замка. Его внимание привлекает прекрасный белый лебедь, превращающийся в девушку.
            Это принцесса Одетта. Зигфриду она раскрывает тайну тяготеющих над ней чар:
            злой волшебник превратил ее в лебедя, и лишь ночью около этих скал она вновь становится девушкой.
            Зигфрид тронут скорбным рассказом Одетты и готов убить колдуна. Но этим не рассеять злых чар.
            Только беззаветная любовь юноши, который еще никогда и никому не клялся в любви,
            может снять с нее злое заклятие.Зигфрид, охваченный чувством любви к Одетте, дает ей клятву вечной верности.
            Внезапно появившийся Злой гений разлучает Одетту и Зигфрида.
             Но Зигфрид уверен в силе и неизменности своего чувства: он освободит Одетту от власти чародея.
            
            ДЕЙСТВИЕ ВТОРОЕ
            
            Картина третья
            
            Торжественный бал в роскошном замке.
            На праздник собираются принцессы из разных стран. Среди них Зигфрид должен выбрать себе невесту.
            Однако он холодно отворачивается от них: принц полон воспоминаний о прекрасной Одетте.
            
            Появляется незнакомый гость. Это Злой гений.
            Он пришел на бал со своей дочерью Одиллией, поразительно похожей на Одетту.
            Одиллия очаровывает принца, и Зигфрид объявляет матери о своем решении жениться на ней. Колдун торжествует.
            Теперь клятва нарушена и Одетта погибнет.
            Со злобным смехом указывает Злой гений на волшебное видение – трепетный образ Одетты.
            Зигфрид понимает, что обманут и в отчаянии устремляется к лебединому озеру.
            
            Картина четвертая
            Берег озера. Мрачная тревожная ночь. Одетта потрясена: теперь ее надежда на освобождение потеряна.
            Вбегает Зигфрид. Он не нарушил клятву: там, в замке, в Одиллии он видел свою Одетту –
            к ней было обращено его любовное признание.
            Злой гений в ярости вызывает против влюбленных силы природы: начинается буря, сверкают молнии.
            Но ничто теперь уже не может сломить юную чистую любовь и разъединить Одетту и Зигфрида.
            Тогда Злой гений сам вступает в единоборство с принцем – и погибает. Его чары рушатся.
            Одетта превращается в девушку и вместе с Зигфридом радостно встречает первые лучи восходящего солнца.
            """;

    public static final String queenOfSpadesLibretto = """
                ДЕЙСТВИЕ ПЕРВОЕ
            
                Картина первая
            
                Петербург. В Летнем саду много гуляющих, дети играют под присмотром нянюшек и гувернанток.
                Сурин и Чекалинский беседуют о своем приятеле Германе: все ночи напролет, мрачный и молчаливый,
                он проводит в игорном доме, но не прикасается к картам.
                Странному поведению Германа удивлен и граф Томский.
                Ему Герман открывает тайну: он страстно влюблен в прекрасную незнакомку, но она богата,
                знатна и принадлежать ему не может. К друзьям присоединяется князь Елецкий.
                Он сообщает о своей предстоящей женитьбе.
                В сопровождении старой графини приближается Лиза, в которой Герман узнает свою избранницу;
                в отчаянии он убеждается, что Лиза – невеста Елецкого.
            
                При виде мрачной фигуры Германа, его пылающего страстью взора,
                зловещие предчувствия охватывают графиню и Лизу. Тягостное оцепенение рассеивает Томский.
                Он рассказывает светский анекдот о графине.
                В дни молодости она однажды проиграла в Париже все свое состояние.
                Ценой любовного свидания молодая красавица узнала тайну трех карт и, поставив на них, вернула проигрыш.
                Сурин и Чекалинский решают подшутить над Германом и предлагают ему узнать у старухи тайну трех карт.
                Но мысли Германа поглощены Лизой. Начинается гроза.
                В бурном порыве страсти Герман клянется добиться любви Лизы или погибнуть.
            
                Картина вторая
            
                Комната Лизы. Вечереет. Свою опечаленную подругу девушки развлекают русской пляской.
                Оставшись одна, Лиза поверяет ночи, что любит Германа. Неожиданно Герман появляется на балконе.
                Он пылко признается Лизе в любви. Стук в дверь прерывает свидание.
                Входит старая графиня. Скрывшись на балконе, Герман вспоминает о тайне трех карт.
                После ухода графини жажда жизни и любви с новой силой пробуждается в нем.
                Лиза охвачена ответным чувством.
            
                ДЕЙСТВИЕ ВТОРОЕ
            
                Картина третья
            
                Бал в доме богатого столичного сановника. На торжество прибывает царственная особа.
                Все с воодушевлением встречают императрицу.
                Князь Елецкий, встревоженный холодностью невесты, уверяет ее в своей любви и преданности.
            
                Среди гостей Герман. Замаскированные Чекалинский и Сурин продолжают подшучивать над приятелем;
                их таинственное нашептывание о магических картах угнетающе действует на его расстроенное воображение.
                Начинается представление – пастораль «Искренность пастушки».
                По окончании представления Герман сталкивается со старой графиней.
                Снова мысль о богатстве, которое сулят три карты, овладевает Германом.
                Получив от Лизы ключи от потайной двери, он решает выведать у старухи тайну.
            
                Картина четвертая
            
                Ночь. Пустая спальня графини. Входит Герман, он с волнением всматривается в портрет графини в молодости,
                но, услышав приближающиеся шаги, прячется. В сопровождении приживалок возвращается графиня.
                Недовольная балом, она предается воспоминаниям о прошлом и засыпает.
                Неожиданно перед ней появляется Герман. Он умоляет открыть тайну трех карт. Графиня в ужасе молчит.
                Взбешенный Герман грозит пистолетом; испуганная старуха падает замертво. Герман в отчаянии.
                лизкий к безумию, он не слышит упреков прибежавшей на шум Лизы.
                Лишь одна мысль владеет им: графиня мертва, а тайны он не узнал.
            
                ДЕЙСТВИЕ ТРЕТЬЕ
            
                Картина пятая
            
                Комната Германа в казармах. Поздний вечер.
                Герман перечитывает письмо Лизы: она просит прийти его в полночь на свидание.
                Герман снова переживает случившееся, в его воображении встают картины смерти и похорон старухи.
                В вое ветра ему слышится заупокойное пение. Германа охватывает ужас.
                Он хочет бежать, но ему мерещится призрак графини.
                Она называет ему заветные карты: «Тройка, семерка и туз». Герман повторяет их как в бреду.
            
                Картина шестая
            
                Зимняя канавка. Здесь Лиза должна встретиться с Германом.
                Она хочет верить, что любимый невиновен в смерти графини. Башенные часы бьют полночь.
                Лиза теряет последнюю надежду.
                Герман приходит с большим опозданием: ни Лиза, ни ее любовь для него уже не существуют.
                В его обезумевшем мозгу лишь одна картина: игорный дом, где он обретет богатство.
                В порыве безумия он отталкивает от себя Лизу и с криком: «В игорный дом!» – убегает.
                Лиза в отчаянии бросается в реку.
            
                Картина седьмая
            
                Зал игорного дома. Герман одну за другой ставит две карты, названные графиней, и выигрывает.
                Все ошеломлены. Упоенный победой Герман ставит на карту весь выигрыш.
                Вызов Германа принимает князь Елецкий.
                Герман объявляет туза, но… вместо туза в руках его оказывается дама пик.
                В исступлении смотрит он на карту, в ней ему чудится дьявольская усмешка старой графини.
                В припадке безумия он кончает с собой.
                В последнюю минуту в сознании Германа возникает светлый образ Лизы. С ее именем на устах он умирает.
            """;
}

